Parsing_WSDL/TestCases/wsdl_sample.wsdl.json

[{"name":"Calculator","port":[{"name":"CalculatorSoap","address":"http://www.dneonline.com/calculator.asmx","operations":[{"name":"Add","actionUrl":"http://tempuri.org/Add","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:Add>\r\n      <tns:intA>string</tns:intA>\r\n      <tns:intB>string</tns:intB>\r\n    </tns:Add>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:AddResponse>\r\n      <tns:AddResult>string</tns:AddResult>\r\n    </tns:AddResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"Adds two integers. This is a test WebService. ©DNE Online","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"Subtract","actionUrl":"http://tempuri.org/Subtract","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:Subtract>\r\n      <tns:intA>string</tns:intA>\r\n      <tns:intB>string</tns:intB>\r\n    </tns:Subtract>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:SubtractResponse>\r\n      <tns:SubtractResult>string</tns:SubtractResult>\r\n    </tns:SubtractResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"Multiply","actionUrl":"http://tempuri.org/Multiply","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:Multiply>\r\n      <tns:intA>string</tns:intA>\r\n      <tns:intB>string</tns:intB>\r\n    </tns:Multiply>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:MultiplyResponse>\r\n      <tns:MultiplyResult>string</tns:MultiplyResult>\r\n    </tns:MultiplyResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"Divide","actionUrl":"http://tempuri.org/Divide","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:Divide>\r\n      <tns:intA>string</tns:intA>\r\n      <tns:intB>string</tns:intB>\r\n    </tns:Divide>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:DivideResponse>\r\n      <tns:DivideResult>string</tns:DivideResult>\r\n    </tns:DivideResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"}]},{"name":"CalculatorSoap12","address":"http://www.dneonline.com/calculator.asmx","operations":[{"name":"Add","actionUrl":"http://tempuri.org/Add","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:Add>\r\n      <tns:intA>string</tns:intA>\r\n      <tns:intB>string</tns:intB>\r\n    </tns:Add>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:AddResponse>\r\n      <tns:AddResult>string</tns:AddResult>\r\n    </tns:AddResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"Adds two integers. This is a test WebService. ©DNE Online","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"Subtract","actionUrl":"http://tempuri.org/Subtract","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:Subtract>\r\n      <tns:intA>string</tns:intA>\r\n      <tns:intB>string</tns:intB>\r\n    </tns:Subtract>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:SubtractResponse>\r\n      <tns:SubtractResult>string</tns:SubtractResult>\r\n    </tns:SubtractResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"Multiply","actionUrl":"http://tempuri.org/Multiply","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:Multiply>\r\n      <tns:intA>string</tns:intA>\r\n      <tns:intB>string</tns:intB>\r\n    </tns:Multiply>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:MultiplyResponse>\r\n      <tns:MultiplyResult>string</tns:MultiplyResult>\r\n    </tns:MultiplyResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"},{"name":"Divide","actionUrl":"http://tempuri.org/Divide","input":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:Divide>\r\n      <tns:intA>string</tns:intA>\r\n      <tns:intB>string</tns:intB>\r\n    </tns:Divide>\r\n  </soap:Body>\r\n</soap:Envelope>","output":"<?xml version=\"1.0\" encoding=\"utf-16\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tns=\"http://tempuri.org/\">\r\n  <soap:Body>\r\n    <tns:DivideResponse>\r\n      <tns:DivideResult>string</tns:DivideResult>\r\n    </tns:DivideResponse>\r\n  </soap:Body>\r\n</soap:Envelope>","InputParameters":[],"OutputParameters":[],"SendInputBodyAs":2,"ResponseOutputAs":2,"InputContentType":"text/xml;charset=utf-8","OutputContentType":"text/xml;charset=utf-8","Description":"","BodyNamespace":"","BodyUse":2,"BodeRequired":false,"BodyEncoding":"","HttpVerb":"POST"}]}]}]